[
  {
    "eventName": "CodeHub",
    "category": "Coding",
    "one_line_desc": "Showcase your coding expertise in a competitive and interactive environment! ",
    "description": "CodeHub is an exhilarating coding competition designed to test participants' logical thinking, problem-solving skills, and programming expertise. The event features rounds involving algorithmic puzzles, debugging tasks, and hands-on coding challenges to inspire creativity and precision. Participants will compete in teams of two to tackle progressively difficult problems, demonstrating their ability to think critically under time constraints.",
    "round_title_1": "CodeDetect",
    "round_desc_1": "Participants will compete in a fast-paced, interactive quiz designed to test their programming acumen. Using the Kahoot platform, teams must quickly identify and fix coding errors, complete incomplete code snippets, and predict outputs. This round focuses on essential coding skills like debugging, syntax understanding, and logic building.",
    "round_title_2": "Decode",
    "round_desc_2": "Teams of two will showcase their analytical and problem-solving skills by deducing algorithms from given input-output examples. Participants must identify the underlying logic, write its pseudocode, and implement the solution in Python or C. This round tests creativity and algorithmic thinking under time constraints.",
    "eventId": "EVNT03",
    "contact_name_1": "P .K. Suriya",
    "roll_1": "22U249",
    "contact_mobile_1": 8825521669,
    "contact_name_2": "B.Bharathy Abinaya",
    "roll_2": "22U208",
    "contact_mobile_2": 8524974767,
    "hall": "G404,405",
    "eventRules": "ROUND 1 RULES:\n->1. Teams will compete in real-time to solve multiple-choice and puzzle-based questions.\n\n\n2. Questions will focus on identifying errors, completing syntax, and predicting code outputs.\n\n\n3. Speed and accuracy will determine the scores, with top teams advancing to the next round.\nROUND 2 RULES:\n->1. Teams will receive input-output pairs and must deduce the algorithm generating the outputs.\n\n\n2. Both pseudocode and the actual implementation (in C or Python) must be submitted.\n\n\n3. The difficulty level increases with each problem.\n\n\n4. Points are awarded based on:\n\nCorrect identification of the algorithm.\n\nClarity and correctness of the pseudocode and implementation.\n\n\n\n5. Time is limited for each problem.\n\n\n6. Participants must bring their own laptops for this round.\n",
    "teamSize": 2,
    "date": "15",
    "timing": "9.30 AM -12.30 PM",
    "closed": false,
    "image": "https://pbs.twimg.com/profile_images/1234332791271194624/Uf-zowvu_400x400.jpg"
  },
  {
    "eventName": "NUMERIX",
    "category": "Science",
    "one_line_desc": "Join the fun with math puzzles, bingo and trivia‼️",
    "description": "This event tests participant's mathematical skills in three exciting rounds. In Round 1, solve a mathematician's photo puzzle to unlock a Nanogram challenge. Round 2 features Bingo with a twist, cross out prime factors of announced number to win. In the final round, teams face a buzzer-based quiz across six math subtopics, strategically avoiding one topic.",
    "round_title_1": "Nanogram Quest",
    "round_desc_1": "Participants have to solve a photo puzzle of a mathematician. Once they figure out the puzzle, they will unlock a Nanogram puzzle. A Nanogram is a fun logic-based puzzle where you need to fill in a grid with numbers based on clues to reveal a hidden pattern.",
    "round_title_2": "Factoria",
    "round_desc_2": "Participants will enjoy a unique twist on Bingo. Instead of traditional numbers, players will mark off prime factors of the numbers called out. Players must identify and cross them off on their bingo cards. The goal is to complete a line, column, or diagonal by marking off all prime factors of the announced number",
    "round_title_3": "Math Buzzer",
    "round_desc_3": "Participants will compete in a buzzer-based quiz covering six math subtopics. Each team will participate in five subtopics and strategically avoid one subtopic. Teams must answer questions quickly and accurately to earn points. The team with the highest points at the end of the round will be declared the winner.",
    "eventId": "EVNT04",
    "contact_name_1": "Kavya Shree Ranganathan",
    "roll_1": "22I328",
    "contact_mobile_1": 8220998080,
    "contact_name_2": "Ibrahim Jameel I S",
    "roll_2": "22M118",
    "contact_mobile_2": 9940013677,
    "hall": "J310, J313, J314",
    "eventRules": "ROUND 1 RULES:\n->Both the photo puzzle and the Nanogram must be completed within the given time limit.\nOnce an answer sheet is submitted, teams cannot retrieve it for changes or corrections.\nTeams are not allowed to use external resources (like mobile phones, calculators) to solve the puzzles.\n\nROUND 2 RULES:\n->Teams must mark only the prime factors of the announced numbers on their Bingo cards.\nTeams should carefully verify each prime factor before marking to avoid penalties for incorrect entries.\nOnce a team calls out “Bingo!”, their card will be checked. Incorrect claims will result in penalties or disqualification.\nTeams are not allowed to use external resources, such as calculators or phones, to identify prime factors.\n\nROUND 3 RULES:\n->Participants must press the buzzer to answer the questions.\nThe first two teams to press the buzzer will be given the chance to answer.\nCalculators are allowed to assist in solving questions.",
    "teamSize": "1-2",
    "date": "15",
    "timing": "9:30 AM - 12:30PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcStMWcwDHjb2eHJin56Ki6W-vx4iWgxjI9d9w&s"
  },
  {
    "eventName": "Runway Rush",
    "category": "Fashion and Textile",
    "one_line_desc": "Bid, Buy, Sew",
    "description": "This is an event where the participants will be competing based on their knowledge on fashion and experience real time auction. The preliminary two rounds would test their knowledge on how will they use the given amount of cash to buy the desired style of garment and fabric. Then the main part of this event which is to sew a miniature garment of the style and fabric they chose, within the rules provided.",
    "round_title_1": "Bid, buy and sew a garment",
    "round_desc_1": "The are total of 3 phase in the game \r\n\r\nPhase 1 Style Selection :\r\n\r\nThe participants will be given with the initial amount of virtual money. Various garment with different style is displayed to the participants before hand, with the given amount of money the participants will start to bid on the style of the garment they need. The participants with the maximum biding amount will get the desired style. The participants can choose the style of garment by considering the factors like time limit and how convenient is to sew the style. The objective is that the teams should choose the style which is convenient for them and also save some amount of virtual money for the next round to buy fabric. This allows us to know how will the participants manage the amount of money given to them.the bidding technique used in this phase is English auction \r\n\r\nPhase 2 Fabric Auction :\r\n\r\n this round the teams will use their remaining amount of virtual money to buy the fabrics . The fabrics which are available will be shown before hand to the participants, each team will be presented with a selection of fabrics, each possessing unique characteristics and a well designated price, they have to select two fabrics. The objective is for teams to strategically bid on the fabrics they believe will best complement their chosen design concept or style, keeping in mind the budget constraints established in the previous round. The type of auction done in this phase is Dutch auction.The fabric auction will not only test the teams knowledge of various fabric types and their application in fashion design, but also their ability to manage a limited budget effectively. This round emphasizes both creativity and financial acumen, requiring participants to balance their aesthetic judgment. By the end of this round, the teams will have gathered a collection of fabrics suited to their designs, setting the stage for the next phase of the competition.\r\n\r\nPhase 3 Sew the Garment:\r\n\r\nBy using the garment style and fabric which is brought in round one and two, the participants will sew a miniature garment in the given measurements within the time limit. The participants have to incorporated the exact style which they have chosen in round 1. \r\nThe participants will be evaluated on the basis of their technical skill: How well is the garment constructed? Are the stitches even, secure, and visually appealing? And also Design fidelity: How closely does the finished garment resemble the chosen style? Are the design elements accurately executed?",
    "eventId": "EVNT05",
    "contact_name_1": "Akshatha R",
    "roll_1": "22H202",
    "contact_mobile_1": 9345554538,
    "contact_name_2": "Sandhiya S",
    "roll_2": "22H230",
    "contact_mobile_2": 9943436697,
    "hall": "J 415 and Garment construction lab (K Block - 3rd floor)",
    "eventRules": "RULES:\n->1.The amount of money given in the initial around should be used for both phase 1 and phase 2 \r\n2. The student should bring the necessary things for the stitching.(Such as scissors..etc .)\r\n3.the style which is brought by the participants through the auction should be replicated exactly.",
    "teamSize": "2",
    "date": "14",
    "timing": "1.30 PM - 4.30 PM",
    "closed": false,
    "image": "https://img.playstationtrophies.org/images/2023/09/25/icon/276cf64ee9f95a02007eb2ac29e4814f-l.png"
  },
  {
    "eventName": "HackQuest ",
    "category": "Coding",
    "one_line_desc": "Crack the Code, Win the Quest!",
    "description": "HackQuest is an exciting team event where participants solve a series of challenges within 2 hours. Each team needs to unlock five levels by cracking the questions correctly to get the answer ( SECRET CODE ). The team that solves the most levels the fastest,wins.",
    "round_title_1": "Wall Breaker",
    "round_desc_1": "In this single-round event, each team will face five challenging and interesting levels. Each level presents a unique quest that must be solved to obtain the SECRET CODE. Teams must submit the correct code to unlock the next level. Think logically and create a strategy to crack these levels. Points are awarded based on the number of levels cleared and the completion time. The team that breaches the most levels the fastest will be declared as the winner.",
    "eventId": "EVNT07",
    "contact_name_1": "S.Nithya Shri",
    "roll_1": "22I353",
    "contact_mobile_1": 9786233264,
    "contact_name_2": "Vishnu Vardhan P",
    "roll_2": "22I373",
    "contact_mobile_2": 7418377571,
    "hall": "IT Main Lab",
    "eventRules": "RULES:\n->1. Bonus Challenge: If the tie persists, a bonus challenge or tiebreaker question will be given. The first team to solve it correctly will win.\n\n3. No phones allowed\n\n4. Complete the round within 2 hours.\n\n5. Levels must be solved sequentially.\n\n6. Cheating leads to disqualification.\n\n7. Points awarded for each completed level.",
    "teamSize": "2-3",
    "date": "14",
    "timing": "9.30 AM -12.30 PM",
    "closed": false,
    "image": "https://pbs.twimg.com/profile_images/1734099293676396544/jIdC7NYM_400x400.jpg"
  },
  {
    "eventName": "RoboSumo",
    "category": "Bot",
    "one_line_desc": "Classic Sumo Takedown, Robot Style",
    "description": "Two robots compete in a head-to-head match following the basic system of traditional human sumo matches. Robots are allowed no weapons and are not allowed to flip each other. The sole purpose is a pushing match between the two robots to eliminate the other from the arena through force only",
    "round_title_1": "League",
    "round_desc_1": "The first round of RoboSumo will feature a group stage, where teams will be divided into groups of five. Each group will compete in a dedicated arena, with each team battling against three randomly selected opponents from their group. A battle will be won by the team that scores 5 points first. The top-scoring team(s) from each group, as determined by the number of participants, will advance to the next round.",
    "round_title_2": "Showdown",
    "round_desc_2": "The second round of RoboSumo will bring together all the top-scoring teams from the previous round into a single group. In this round, each team will compete against every other team in the group. The winning team in each battle will be the first to score 5 points. Ultimately, the winner and runner-up of RoboSumo will be determined based on their cumulative points earned during this round.",
    "eventId": "EVNT08",
    "contact_name_1": "Arrunkumar K",
    "roll_1": "22R203",
    "contact_mobile_1": 8867915641,
    "contact_name_2": "Linges Naraian",
    "roll_2": "22R220",
    "contact_mobile_2": 6381837989,
    "hall": "G601, G501, G401",
    "eventRules": "Round 1 RULES:\n->Arena Specifications:\n\tThe ring shall be circular in shape and of the appropriate dimensions\n\tShikiri lines (starting lines) consist of two painted parallel brown lines cantered in the ring with appropriate width and spacing. The separation distance between the lines is measured to their outside edges from the circle\n\tThe border line is marked as a white circular ring of an appropriate width on the outer edge of the playing surface. The ring area extends to the outside edge of this circular line\nRules:\n\tRobots are only allowed to ram each other within the arena to eliminate the opponent, no other means of offense will be allowed\n\tThe robot should be controlled only through the wireless mode, wired mode of control will not be allowed to participate\n\tParts that could break the ring, damage the opponent’s robot or its operator are strictly not allowed. Normal pushes and rams are not considered intent to damage\n\tDevices that can store liquid, powder, gas or other substances for throwing at the opponent and any flaming devices are not allowed\n\tSticky substances to improve traction or devices to increase down force, such as a vacuum pump or magnets are not allowed\n\tAll edges, including but not limited to the front scoop, must not be sharp enough to scratch or damage the ring, other robots or players\n\tA point is earned by a team when they successfully push the opponent team out of the arena whilst obeying the rules\n\nRound 2 RULES:\n->Arena Specifications:\n\tThe ring shall be circular in shape and of the appropriate dimensions\n\tShikiri lines (starting lines) consist of two painted parallel brown lines cantered in the ring with appropriate width and spacing. The separation distance between the lines is measured to their outside edges from the circle\n\tThe border line is marked as a white circular ring of an appropriate width on the outer edge of the playing surface. The ring area extends to the outside edge of this circular line\nRules:\n\tRobots are only allowed to ram each other within the arena to eliminate the opponent, no other means of offense will be allowed\n\tThe robot should be controlled only through the wireless mode, wired mode of control will not be allowed to participate\n\tParts that could break the ring, damage the opponent’s robot or its operator are strictly not allowed. Normal pushes and rams are not considered intent to damage\n\tDevices that can store liquid, powder, gas or other substances for throwing at the opponent and any flaming devices are not allowed\n\tSticky substances to improve traction or devices to increase down force, such as a vacuum pump or magnets are not allowed\n\tAll edges, including but not limited to the front scoop, must not be sharp enough to scratch or damage the ring, other robots or players\n\tA point is earned by a team when they successfully push the opponent team out of the arena whilst obeying the rules.",
    "teamSize": "2-3",
    "date": "15",
    "timing": "9.30 AM-4.30 PM",
    "closed": false,
    "image": "https://i.ytimg.com/vi/-Yu5YH5yitM/maxresdefault.jpg"
  },
  {
    "eventName": "INNOVATION FORUM",
    "category": "Fashion and Textile",
    "one_line_desc": "Unravel the Future: Where Textile Minds Meet Innovation!",
    "description": "INNOVATION FORUM is a three-round competition designed to test and showcase participants' technical knowledge, critical thinking, and innovative problem-solving skills in the textile industry.",
    "round_title_1": "TEX RUSH",
    "round_desc_1": "Participants tackle a rapid-fire quiz on textile-related topics, earning points for correct answers and losing points for wrong or skipped responses. This round tests their technical knowledge and quick thinking.",
    "round_title_2": "THE DISCUSSION DESK",
    "round_desc_2": "The top 10 participants engage in a panel discussion on a textile industry challenge, showcasing their knowledge, teamwork, and innovative ideas. Judges select the top 5 based on their performance and collaboration.",
    "round_title_3": "SOLUTION SUMMIT",
    "round_desc_3": "The top 5 will be shortlisted and should submit written solutions to the problem discussed and present them in an oral examination. Judges evaluate innovation, feasibility, and clarity of the participants.",
    "eventId": "EVNT09",
    "contact_name_1": "Sathaa Sree S M",
    "roll_1": "22T126",
    "contact_mobile_1": 6374145789,
    "contact_name_2": "Preeti P",
    "roll_2": "22T121",
    "contact_mobile_2": 9092019119,
    "hall": "H205 , H206, H207",
    "eventRules": "Round 1:\n->Only one minute will be given.\nNegative marks for each wrong answer and skipped questions.\nRound 2:\n->No mobiles or any other internet sources should be used.\nJudges decision is final.\nRound 3:\n->No mobiles or any other internet sources should be used.\nJudges decision is final.\n",
    "teamSize": "1",
    "date": "15",
    "timing": "9.30 AM - 12.30 PM",
    "closed": false,
    "image": "https://i.ytimg.com/vi/q28h9kCZXks/maxresdefault.jpg"
  },
  {
    "eventName": "Kriya Open Quiz",
    "category": "Quiz",
    "one_line_desc": "where Knowledge meets Spontaneity!!",
    "description": "The first round of the quiz competition is a classic pen-and-paper challenge designed to test your knowledge and quick thinking. Participants will tackle a series of 25 questions, each carrying 1 point with in-built tie-breakers.\nThe finale will have 3 segments.\nTheme-Based Round: Teams select a theme and answer a question related to it.\nUNO Cards Round: Teams bid for questions using UNO cards and have 3 lifelines.\nRapid Fire Round: Fastest team on the buzzer answers; +10 for correct, -5 for wrong.",
    "round_title_1": "Prelims",
    "round_desc_1": "It is a pen and paper round. There are 25 Questions in this quiz. Each question carries 1 point. No negative marking. Part Points will be given wherever applicable. There are inbuilt tiebreakers in this round. Top 8 teams from round 1 qualify for further rounds.",
    "round_title_2": "Finals",
    "round_desc_2": "Theme Based Round\n Each team will choose a theme based on which they will get a question.\n\nUNO Cards Round\n All teams are provided with Uno Cards to bid for a question. And also each team will be provided with 3 lifeline cards.\n\nRapid Fire Round\n Fastest team to press the buzzer will answer the question, if the answer is correct the team will be awarded with 10 points and if the answer is incorrect the team will be awarded with -5 points.",
    "eventId": "EVNT10",
    "contact_name_1": "SACHINBALAJI U",
    "roll_1": "22E148",
    "contact_mobile_1": 8838070795,
    "contact_name_2": "KUMBESH BABU B",
    "roll_2": "22E130",
    "contact_mobile_2": 9176671318,
    "hall": "F-Block Assembly Hall",
    "eventRules": "RULES:\n->Usage of any external communication devices like mobile phones, smartwatches etc., are prohibited.\nQM's decision is FINAL and BINDING.\n",
    "teamSize": "1-2",
    "date": "14",
    "timing": "9:30 AM - 12:30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRtbDf8dYDSSH7TXQ8BlKcI52pNOYAb_4olKw&s"
  },
  {
    "eventName": "Auction to Action",
    "category": "Core Engineering",
    "one_line_desc": "An Adventurous Journey through the world of Metals.",
    "description": "The AUCTION TO ACTION is an exciting and fun-filled journey through the world of metals. In this three-round event, participants will bid, solve challenges, and escape tricky situations, all while learning more about metals and alloys.",
    "round_title_1": "Metal Auction",
    "round_desc_1": "Participants will use virtual money to bid on different metals or alloys. They’ll get clues about the metal’s properties or uses and need to make smart bids.",
    "round_title_2": "Surprise Pen",
    "round_desc_2": "In this round, teams will be given a challenge to solve using only a pen and paper. It could be completing diagrams, answering questions, or solving puzzles about metals.",
    "round_title_3": "Escape Room",
    "round_desc_3": "Teams will face a metallurgical-themed escape room. They’ll need to solve puzzles and find clues about metals to escape within the time limit.",
    "eventId": "EVNT11",
    "contact_name_1": "Rithanya D",
    "roll_1": "22Y213",
    "contact_mobile_1": 9443130573,
    "contact_name_2": "Mohamad Niyas A",
    "roll_2": "22Y210",
    "contact_mobile_2": 6374241719,
    "hall": "G606, G607",
    "eventRules": "Round 1 RULES:\n->1. Materials are sold to the highest bidder.\n2. Once the auctioneer announces a material to be sold, it can't be withdrawn.\n3. Teams can use only the initial currency(virtual) given to them.\n4. The team with the metals of most points will win.\n5. No Mobile Phones are allowed.\n\nRound 2 RULES:\n->1. The team must answer each questions within the time limit.\n2. No Mobile Phones are allowed.\n3. Discussion is allowed within their own teams.\n\nRound 3 RULES:\n->1. No Mobile Phones are allowed.\n2. Discussion is allowed within their own teams.\n3. The team escaping the room first will be declared as the winners.\n4. No malpractice is allowed.",
    "teamSize": "2",
    "date": "15",
    "timing": "9.30 AM -12.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTIF4cP158bwhSu2E09KdmcSN1IbLGofT5c3A&s"
  },
  {
    "eventName": "Binary×Forge",
    "category": "Coding",
    "one_line_desc": "Conquer the Challenge, Defeat the Impossible at Binary×Forge!!!",
    "description": "“BinaryxForget” will be a two round technical event, where the participants will be challenged on their knowledge of different programming languages, as well as be tested on their logical thinking abilities with various puzzles. \n\nThe goal of this event is to test the abilities of the participants, improve their teamwork, logical thinking abilities, as well as inform them about important terms from the emerging fields in the tech world.",
    "round_title_1": "HoneyPot",
    "round_desc_1": "\nSTAGE1!\nDeceptiCon – The AI Deception Game\n Participants are divided into two teams: Deceivers and Decoders.\n ❖ Deceivers: Create human-like content such as images, recordings, or text messages \ndesigned to trick the other team into thinking it was generated by AI.\n ❖ Decoders: Analyze the content and determine whether it was created by AI or humans.\n\nSTAGE2!\nCipher Siege – Unlock the Hidden Key\n Teams face a series of technical challenges to uncover fragments of a hidden key. Participants \nsolve various problems to uncover parts of the key. Challenges include:\n ❖ Cryptographic Puzzles: Solve encrypted messages using basic ciphers (Caesar cipher, \nVigenère cipher, etc.) or custom encryption algorithms.\n ❖ Logic Challenges: Solve puzzles or riddles that reveal additional pieces of the key.",
    "round_title_2": "Labyrinth of Secrets",
    "round_desc_2": "In this classical CTF, you’ll navigate through a series of cybersecurity challenges, each unlocking the next level. Solve tasks like cryptography, reverse engineering, and web security to find hidden \"flags.\" Each flag reveals a clue to progress deeper into the labyrinth, testing your skills and knowledge along the way. Can you unlock every level and emerge victorious?",
    "eventId": "EVNT12",
    "contact_name_1": "Lohith S",
    "roll_1": "22N228",
    "contact_mobile_1": 9488125100,
    "contact_name_2": "Mehul Dinesh",
    "roll_2": "22N232",
    "contact_mobile_2": 8608715000,
    "hall": "AIR Lab (E-block 3rd floor)",
    "eventRules": "Round 1 RULES:\n->❖ Time Limit: 1 to 2 hours, based on our discretion.\n ❖ This round will be held on a proprietary platform built in house by members of the club.\n ❖ The participants are not allowed to use the internet unless explicitly stated  to do so. \n❖ All tie-breakers will be handled automatically by the platform in Round-2 based on the \ntime of submission.\n ❖ Final winners will be decided based on the aggregate score from both rounds.\n ❖ All participants from round-1 are eligible to participate in round-2. There will be no eliminations.\n ❖ The organizers reserve the right to resolve any discrepancies.\n\nRound 2 RULES:\n->❖ Time Limit: 1 to 2 hours, based on our discretion.\n ❖ This round will be held on a proprietary platform built in house by members of the \nclub.\n ❖ The participants are not allowed to use the internet unless explicitly stated  to do so. \n❖ All tie-breakers will be handled automatically by the platform in Round-2 based on the \ntime of submission.\n ❖ Final winners will be decided based on the aggregate score from both rounds.\n ❖ All participants from round-1 are eligible to participate in round-2. There will be no eliminations.\n ❖ The organizers reserve the right to resolve any discrepancies.\n",
    "teamSize": "2-4",
    "date": "14",
    "timing": "9.30 AM -4.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSIhP9Lj_20Y_sUFHlg-l9hSq3AT5Umr41W4A&s"
  },
  {
    "eventName": "Quizzy Crushy: Auto Edition",
    "category": "Quiz",
    "one_line_desc": "Drive through a world of exciting Automotive quiz and innovate your structure",
    "description": "The event tests the participants knowledge on basic Automotive concepts and principles. The event will only test the participants on basic concepts and not on advanced topics so that even students who only have basic Automotive knowledge can participate in the event.",
    "round_title_1": "Auto Quiz and Part Detection",
    "round_desc_1": "Phase 1:\nAuto quiz - Participants are displayed with MCQ questions that are related to automobile and asked to write the answers in the A4 sheet provided to them.\nPhase 2:\nPart detection - Participants are displayed with questions that are related to Automotive components and are provided with a buzzer.\n(Phase 1 + Phase 2) - Marks are evaluated and based on that participants move on to the next round.",
    "round_title_2": "Crashworthiness",
    "round_desc_2": "Participants are provided with components such as Ice cream stick, fevicol and other necessary materials for this round and are asked to make a model which is rigid and strong. The winner will be announced depending on how their model withstands under different testing conditions. If in case of any tie breakers the judge will decide regarding the tie breaker event.",
    "eventId": "EVNT13",
    "contact_name_1": "Aditya K",
    "roll_1": "21A205",
    "contact_mobile_1": 7200845251,
    "contact_name_2": "S Naresh",
    "roll_2": "21A228",
    "contact_mobile_2": 7358893143,
    "hall": "K501,K502",
    "eventRules": "RULES:\n->The event rules will be informed by the convenors at the start of the event.\n",
    "teamSize": "2",
    "date": "14",
    "timing": "9.30 AM -12.30 PM",
    "closed": false,
    "image": "https://play-lh.googleusercontent.com/5qEFHRfdaT-ozBI3tD3iaoizZysyKNYZGf-rNaIu9aG6c6ibiP1x25zUHa5GRYIKhHc=w600-h300-pc0xffffff-pd"
  },
  {
    "eventName": "TaskOps",
    "category": "Coding",
    "one_line_desc": "Tackle the Tasks and Break the Hackathon!",
    "description": "Players earn points in the first round through technical and creative\r\nchallenges and redeem these points for strategic advantages in the second round, where they develop and present innovative projects.",
    "round_title_1": "Taskathon",
    "round_desc_1": "Questions of different themes, skill and complexity will be given and teams can choose which questions to solve. Each question will award some points.\r\nThese points can be used to buy powerups for the upcoming hackathon.",
    "round_title_2": "Buildathon",
    "round_desc_2": "Using the powerups they bought in the first round, teams can start ideating and implementing their solutions for a given set of problem statements. \r\nThey will present their solutions to the judges by the end of the day.",
    "eventId": "EVNT14",
    "contact_name_1": "Sreeraghavan R",
    "roll_1": "22z261",
    "contact_mobile_1": 6385786223,
    "contact_name_2": "J Prasheetha",
    "roll_2": "22N224",
    "contact_mobile_2": 9962031353,
    "hall": "CSE - GRD Lab, CSE - Programming Lab",
    "eventRules": "Round 1 RULES:\n->Tasks must be completed sequentially, one at a time.\r\n\r\nPoints must be redeemed before moving into project ideation.\nRound 2 RULES:\n->Projects must be developed within the given timeframe\r\n\r\nPresentations must adhere to the time limit and include a demonstration.",
    "teamSize": "2-4",
    "date": "15",
    "timing": "9.30 AM -12.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQfOnfki0Fs9OWDKPPZH3VjeZ6T7euRMnBQ-Q&s"
  },
  {
    "eventName": "COUTURE CHRONICLE",
    "category": "Fashion and Textile",
    "one_line_desc": "\"Threads of Tradition, Tales, and Transformation!\"",
    "description": "Celebrate India's vibrant culture in \"Shades of Culture,\" decode literary gems in \"Read & Reflect,\" and champion sustainability in \"Craft from Scrap.\" This engaging event blends heritage, intellect, and creativity, inspiring participants to innovate and reflect while celebrating diversity and resourcefulness!",
    "round_title_1": "Shades of Culture",
    "round_desc_1": "\nThis round celebrates India's cultural diversity. Participants will solve clues and match images of traditional attire or cultural elements to their respective states. Some images will feature jumbled words that participants must unscramble to complete the task.\n",
    "round_title_2": "Read & Reflect",
    "round_desc_2": "\nThis literature-based round challenges participants to explore a selected book. They will analyze specific words or phrases, understand the context, and answer questions based on the topic. This round assesses their comprehension and critical thinking skills.",
    "round_title_3": "Craft from Scrap",
    "round_desc_3": "\n Focused on sustainability, this round tasks participants with using textile waste, such as sewing scraps and fabric remnants, to craft unique products. Creations will be evaluated on innovation, utility, and craftsmanship.",
    "eventId": "EVNT15",
    "contact_name_1": "Pooja J",
    "roll_1": "22T120",
    "contact_mobile_1": 8220264281,
    "contact_name_2": "Saravanakumar B",
    "roll_2": "22T124",
    "contact_mobile_2": 9944426383,
    "hall": "H205, H206, H207",
    "eventRules": "ROUND 1 RULES:\n->Participants will be evaluated based on timing.\nNo electronic gadgets are allowed.\nROUND 2 RULES:\n->No electronic gadgets are allowed\nWill be evaluated based on the accuracy of the answers.\nJudges decision is final.\nRound 3 RULES:\n->Requirements will be given\n30 mins will be given\nJudges decision is final.",
    "teamSize": "2",
    "date": "16",
    "timing": "9.30 AM -4.30 PM",
    "closed": false,
    "image": "https://i0.wp.com/www.whentaniatalks.com/wp-content/uploads/2014/11/MAC-Harmony-Thumbnail-1024x1024.jpg?ssl=1"
  },
  {
    "eventName": "Fortune Flick",
    "category": "Science",
    "one_line_desc": "Where Tech meets Luck : Solve,Unlock and Conquer!",
    "description": "\nFortune Flick combines the thrill of decision-making with a test of technical prowess! The event kicks off with participants solving electronics-related questions to unlock briefcases containing points or mystery challenges like debugging code, building logic circuits, or solving rapid-fire puzzles. A surprise briefcase chosen by the player at the start adds an exciting twist—will it hold jackpot points or a tough challenge? Strategic choices and tech skills drive success in this round.  \n\nIn the next round, participants spin a wheel to determine their tasks, blending luck with knowledge. Each question answered correctly earns additional points . From circuit assembly to creative problem-solving, each spin tests technical adaptability.  \n\n Will you take the risk or play it safe?",
    "round_title_1": "Quiz or No Deal !",
    "round_desc_1": "Quiz or No Deal is an exciting technical twist on the classic Deal or No Deal! Players must navigate through a board of briefcases, each containing points . The game begins with players selecting one briefcase as their potential winning case. To unlock and open the remaining cases, players answer questions from electronics, programming, and general tech topics.\n\nAdding to the excitement, some briefcases contain Mystery Challenges, such as debugging code, building logic circuits, or solving rapid-fire tech puzzles. The game ends with players deciding whether to stick with their chosen case or swap it, combining technical skills, strategy, and a dash of luck to determine the winner.",
    "round_title_2": "Wheel of Fortune",
    "round_desc_2": "A technical twist to the popular game show \"Wheel of Fortune\". Spin the wheel and get the task according to your fortune. Complete as many tasks as possible in the given time by spinning the wheel. Team with maximum points wins!",
    "eventId": "EVNT16",
    "contact_name_1": "Shri Nithya B",
    "roll_1": "22D243 ",
    "contact_mobile_1": 7904184785,
    "contact_name_2": "Tejaswini K",
    "roll_2": "22D248",
    "contact_mobile_2": 7676690680,
    "hall": "G 405",
    "eventRules": "RULES:\n->No mobile phones allowed\nHave to do tasks as instructed.\nNo discussion with other teams.",
    "teamSize": "2-3",
    "date": "15",
    "timing": "9.30 AM - 12.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSycRQJE9-n-tCRzxtfl5rq1RFDWALqOO5rjQ&s"
  },
  {
    "eventName": "Elegance to the Road: Innovate Assemble Drive",
    "category": "Core Engineering",
    "one_line_desc": "Experience the fusion of innovation and elegance that drives forward.",
    "description": "This event requires some basic knowledge on the features of 3D modelling and understanding related to Automobile services.",
    "round_title_1": "CAD Enhance",
    "round_desc_1": "A CAD design will be provided to the participants and they are asked to complete it on time. Creo software is available in our lab. For any other 3D software participants are asked to bring their own laptops.",
    "round_title_2": "Disassemble and Assemble",
    "round_desc_2": "Any subassembly like gearbox, engine or differential will be given to the teams and are asked to disassemble and assemble with the tools provided within the specified time.",
    "round_title_3": "Pit stop relay and Lotus Simulation",
    "round_desc_3": "Phase 1: Participants are asked to remove and fit the tire of the vehicle at the earliest possible time with the tools provided.\nPhase 2: Participants are given with a glimpse of lotus simulation software and are asked to iterate within the specified time.",
    "eventId": "EVNT17",
    "contact_name_1": "Suresh Kumar",
    "roll_1": "22A246",
    "contact_mobile_1": 8344646461,
    "contact_name_2": "Nikhilan",
    "roll_2": "22A228",
    "contact_mobile_2": 9942673731,
    "hall": "K block simulation hall",
    "eventRules": "RULES:\n->Rules will be intimated to the participants during the start of the event",
    "teamSize": "2",
    "date": "15",
    "timing": "9.30 AM - 12.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRvB7N6mvf6INeXzvcZ0pQEnT802TlkrP-8vg&s"
  },
  {
    "eventName": "Forensicist",
    "category": "Science",
    "one_line_desc": "Whispers of Crime, Shadows of Truth!",
    "description": "The Forensicist is a high-stakes crime-solving adventure for teams of 3-4 players. In Round One, participants step into the killer’s hideout, searching for hidden clues and solving puzzles to prove their sharp observation skills. Only the keenest minds advance to Round Two, where teams become detectives, sifting through evidence, interrogating suspects, and piecing together witness accounts. The clock is ticking—will your team outsmart the killer and solve the mystery before time runs out? The truth is waiting to be uncovered!",
    "round_title_1": "The Web of Lies: The Pursuit",
    "round_desc_1": "\"The Web of Lies: The Pursuit\" is an engaging detective challenge where teams work together to solve a thrilling mystery. It starts with investigating the killer’s room, where players search for key clues and evidence. As they progress, they’ll tackle tasks and answer questions connected to the room and its secrets. Successfully solving these challenges lets them move forward to the next round, inching closer to discovering the killer’s identity. The closer they get, the more intense the investigation becomes. Will your team crack the case and move on?",
    "round_title_2": "The Final Clue: The Revelation",
    "round_desc_2": "The Final Clue: The Revelation is an immersive crime-solving event that puts you in the role of a seasoned investigator. Your mission is to crack a complex murder case by carefully reviewing a comprehensive case file. This file includes detailed statements from suspects and witnesses, a full description of the crime scene, and other key pieces of evidence. You'll dive deep into the contents of the file to understand the case from every angle.\n\nOnce you've absorbed the information, you'll have the opportunity to visit the actual crime scene, where you can observe critical details that might provide further insights. Armed with this knowledge, you'll re-investigate the suspects and witnesses, using the case file or employing cross-examination techniques to extract more information and fill in any gaps.\n\nAfter thoroughly investigating all angles, you and your team will need to make an informed decision to identify the true killer. You’ll also need to articulate the killer's motive based on the evidence you've gathered. The team or individual who correctly identifies the killer and provides a clear explanation of the motive will be recognized as the top investigator, solving the case and revealing the truth behind the mystery.",
    "eventId": "EVNT18",
    "contact_name_1": "Mugesh Karthick J R",
    "roll_1": "22B226",
    "contact_mobile_1": 9944440379,
    "contact_name_2": "Vedya K",
    "roll_2": "22B258",
    "contact_mobile_2": 7010730495,
    "hall": "J313, J314, J411, J413, J414, J415",
    "eventRules": "Round 1 RULES:\n->A team of three to four members will participate in this round.\n\nA killer theme-based room will be set up, where participants will be given to observe the details in the room for 10 minutes.\n\nFollowing that the teams will be playing tasks to answering a series of questions based on their observation. All members are expected to participate in at least one of the tasks.\n\nThe team that answers the questions according to their observation and gains points.\n\nParticipants with high points are qualified for the next round.\n\nParticipants are expected to maintain decorum or else will be eliminated.\n\nRound 2 RULES:\n->In this round the participants are provided with a case file of a crime and are allowed to observe the crime site for 2 minutes.\n\nThey are allowed to interrogate various suspects and eye witnesses for 10 minutes.\n\nThe participants are allowed to discuss within themselves and come up with the criminal (the killer) with an agreeable reason.\n\nThe final answer should be reported by completing the case file with all the necessary details.\n\nTeams guessed the correct killer should provide suitable reasons for accusations of that person(killer).\n\nParticipants are expected to maintain decorum or else will be eliminated.",
    "teamSize": "3-4",
    "date": "16",
    "timing": "9.30 AM  - 4.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSBQ7nqG2r82QWaFRPfOz5Hmb8VaGpSTXJZ0Q&s"
  },
  {
    "eventName": "SpeedDrifters 2.0",
    "category": "Bot",
    "one_line_desc": "Unleash the thrill of precision and speed with every drift !!",
    "description": "The Electric RC Off-Road Race is an exhilarating competition designed for RC car enthusiasts to showcase their skills, creativity, and teamwork. Participants will navigate custom-built electric RC vehicles through a challenging dirt track filled with hairpin bends, obstacles, and surprise elements. The event consists of multiple rounds, including a Technical Inspection, an Acceleration Test, and a high-stakes 30-meter Race Circuit. Teams must demonstrate precision, speed, and innovation to outperform their competitors. With a focus on safety, creativity, and fair play, this event invites individuals and teams to test their engineering prowess and driving expertise. Bonus points are awarded for tackling challenging obstacles and presenting unique vehicle designs. Join us for an action-packed day of competition, camaraderie, and electrifying excitement!\n",
    "round_title_1": "Technical Inspection (TI)",
    "round_desc_1": "This round ensures that all participating RC vehicles comply with the competition's technical and safety standards. Vehicles are inspected for battery safety, including adherence to voltage limits and absence of damage. The structural integrity of the vehicle is evaluated, checking for signs of wear, cracks, or other issues that could impact performance. Electronics, including wiring and component connections, are thoroughly examined to ensure proper functionality and insulation. Compliance with size, weight, and engine type (electric only) is also verified. Radio frequency interference (RFI) levels are monitored to avoid disruptions. Vehicles that fail to meet the criteria are disqualified from proceeding to subsequent rounds.",
    "round_title_2": "Acceleration Test",
    "round_desc_2": "In this performance-based round, participants test their RC cars' ability to accelerate over a straight 10-meter track from a standstill. The primary objective is to measure how quickly the vehicle can achieve maximum speed within this distance. Precision in control is critical, as collisions or veering off-course can result in penalties. This round highlights the power, responsiveness, and stability of each vehicle under acceleration. Participants are not allowed practice trials, and each team has a single opportunity to demonstrate their vehicle's capabilities.",
    "round_title_3": "100-Meter RC Race Circuit",
    "round_desc_3": "The final and most intense round takes place on a rugged 30-meter dirt track designed to challenge both the vehicles and their operators. The track features complex obstacles, including hairpin bends, S-shaped curves, uneven surfaces, and puddles. Participants must navigate these features while maintaining speed and control. Time is the key metric in this round, with each team striving to complete the course as quickly as possible. Precision driving is essential to avoid penalties for reckless driving or going off-track. Vehicles that stray off the course more than twice are automatically disqualified. Bonus points are awarded for crossing specific challenging obstacles and showcasing innovative designs or advanced features, such as suspension systems or custom-built components.",
    "eventId": "EVNT19",
    "contact_name_1": "Rachchelle Phadvas P",
    "roll_1": "22A233",
    "contact_mobile_1": 9600702551,
    "contact_name_2": "Pretyush S",
    "roll_2": "22A237",
    "contact_mobile_2": 9025548549,
    "hall": "N Block Ground",
    "eventRules": "RULES:\n->RC vehicle Dimensions should have a minimum (200mm L, 150mm B, 150mm H) and maximum (550mm L, 350mm B, 350mm). It must not exceed beyond the given size.\nRC vehicles should have electric engines instead of IC engines.\n\nThe RC vehicle is operated using a wireless controller, not a wired one.\nIt is important to ensure that the wires are appropriately insulated.\nWith safety as our top priority, we have set the maximum voltage limit to 24V. This ensures that our equipment runs smoothly and efficiently while keeping you and your surroundings safe.\nIf you plan on using any equipment or methods during the event, please make sure to inform the organizers in advance.\nPlease note that bringing pre-made toy cars is not permitted.",
    "teamSize": "2-4",
    "date": "15",
    "timing": "9.30 AM -4.30 PM",
    "closed": false,
    "image": "https://i.scdn.co/image/ab67616d0000b273444aff357dde30a5b4dd4a0d"
  },
  {
    "eventName": "Codopoly",
    "category": "Coding",
    "one_line_desc": "Debug, trade, and strategize to fix buggy code, earn points  and outscore the competition!",
    "description": "The event unfolds in multiple rounds: participants start by decoding and fixing their main code, followed by trading additional code pieces to maximize their score. Roles like buyer and seller rotate among teammates, encouraging collaboration and adaptability. Action cards, such as Time Boost or Bug Hint, add a layer of strategy to the competition. \n",
    "round_title_1": "Debug Round(s)",
    "round_desc_1": "Teams will receive their first set of buggy code which consists of main and few other code parts that should be traded. Teams will start by decoding the main buggy code. This phase will test the team's ability to quickly understand and they can even fix the bugs in their other code parts.\nDuring this phase, teams will also have the opportunity to fix bugs in the additional code parts that they can trade with other teams later. The goal of this round is to fix as many bugs as possible within the given time frame, preparing the team for the subsequent trading rounds.",
    "round_title_2": "Trade Round(s)",
    "round_desc_2": "Teams These parts of code can be fixed, and then teams will trade these fixed parts with others to earn points.\nTeams are allowed to exchange bug-fixed code which they don't need with other teams for points, based on the difficulty of the errors they have solved. Action Cards can also be traded.\n",
    "eventId": "EVNT20",
    "contact_name_1": "Akash",
    "roll_1": "22z255",
    "contact_mobile_1": 9943803882,
    "contact_name_2": "Deepa Shree",
    "roll_2": "22N213",
    "contact_mobile_2": 9384472009,
    "hall": "3AI Laboratory, SCPS Laboratory, AIR Laboratory E Block 3rd Floor",
    "eventRules": "Round 1 RULES:\n->Time Limit per Debug Round: 15-20 minutes\nEvery team must have a buyer/seller and debugger(s).\n\nRound 2 RULES:\n->Time Limit per Trade Round: 5-7 minutes.\n\nA trade happens only in the presence of a event volunteer. Teams can trade their parts 3-5 times, depending on how the event is structured. The points they earn will depend on the difficulty of the bugs in the code they’ve received and fixed.",
    "teamSize": "2-4",
    "date": "15",
    "timing": "9.30 AM -12.30 PM",
    "closed": false,
    "image": "https://media.racecheck.com/EventInstance/030cfae3-7473-4a80-b55d-a7419aec9c11.jpg"
  },
  {
    "eventName": "CodeStorm",
    "category": "Coding",
    "one_line_desc": "CodeStorm is a competitive coding event challenging participants to solve complex problems with innovative algorithms under time constraints.",
    "description": "*CodeStorm* :\n\nCodeStorm is an exciting coding event where participants tackle challenging logical problems by crafting innovative algorithmic solutions. This event tests problem-solving skills, creativity, and coding expertise, pushing participants to think critically and code efficiently under time constraints.",
    "round_title_1": "Quiz round",
    "round_desc_1": "A total of 40 multiple choice questions will be provided via Google forms. Contestants must complete within the stipulated time.",
    "round_title_2": "Coding round",
    "round_desc_2": "A total of 10 problems statements will be given. The participant must solve those within the stipulated time.",
    "eventId": "EVNT21",
    "contact_name_1": "Janakhan K",
    "roll_1": "24MX209",
    "contact_mobile_1": "8903402357",
    "contact_name_2": "Nitin Sankar A",
    "roll_2": "24MX220",
    "contact_mobile_2": "9042670536",
    "hall": "CC Lab",
    "eventRules": "Round 1 RULES:\n->Questions - 40\nTime duration - 45 Minutes\n\nRound 2 RULES:\n->Questions - 10\nTime duration - 1 hour",
    "teamSize": "1",
    "date": "14",
    "timing": "9.30 AM -12.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQI9zQEit3un1H-C7zYM-VU7a_Wmxi9ya-EGQ&s"
  },
  {
    "eventName": "Aero Glider",
    "category": "Core Engineering",
    "one_line_desc": "Fly to Victory",
    "description": "Teams will design and construct their own gliders on-site using materials provided by the organisers. Top three teams that achieves the greatest gliding distance will be declared the winners.",
    "round_title_1": "Glider Construction",
    "round_desc_1": "Teams will build their gliders using materials provided by the organisers. This round tests the team's ability to design and construct a functional glider within a limited time frame.",
    "round_title_2": "Glider Launch",
    "round_desc_2": "Teams will launch their constructed gliders using hand power. The glider that covers the greatest distance will score the highest.",
    "eventId": "EVNT22",
    "contact_name_1": "Nandhagopal S",
    "roll_1": "20P619",
    "contact_mobile_1": 9080905838,
    "contact_name_2": "Dharanimohan V",
    "roll_2": "23L421",
    "contact_mobile_2": 9843782341,
    "hall": "G 301,302, Football ground",
    "eventRules": "Round 1 RULES:\n->Time Limit: Teams must complete their glider within the specified time.\nMaterial Usage: Only materials provided by the organizers can be used.\nWingspan Restriction: The wingspan of the glider must not exceed 1 meter.\nStructural Requirements: Gliders must meet the basic structural requirements as defined by the organizers. Failure to do so will result in disqualification.\nDisqualification: Teams unable to finish constructing their glider within the time limit will be disqualified from advancing to the next round.\n\nRound 2 RULES:\n->Launch Method: Gliders must be launched by hand without any mechanical assistance.\nMeasurement: The distance covered will be measured from the point of launch to where the nose of the glider comes to rest.\nAttempts: Each team will have 2-3 attempts, with the best distance recorded.\nFair Play: Teams must not interfere with other participants during the launch.\nDisqualification: Any team found violating the rules will be disqualified.",
    "teamSize": "1-3",
    "date": "15",
    "timing": "1.30 PM - 4.30 PM",
    "closed": false,
    "image": "https://i.ytimg.com/vi/b4YrpmhgNGs/maxresdefault.jpg"
  },
  {
    "eventName": "Innovator's Quest",
    "category": "Core Engineering",
    "one_line_desc": "Unbox Creativity, Refine Innovation",
    "description": "This two-round event challenges participants to craft practical solutions for daily challenges and refine them into advanced designs.\n\nFrom spontaneous problem-solving to futuristic design thinking, this event offers an unforgettable blend of creativity, teamwork, and ingenuity.\n",
    "round_title_1": "Hack It Up!",
    "round_desc_1": "Each team will get a set of props like paper cups, rubber bands, modelling clay and more. Teams have 15 minutes to research and design the model and 45 minutes to craft a practical, fun, or clever solution for common daily life challenges using the props(e.g., organizing messy cables, keeping coffee warm, carrying grocery bags without hand strain, etc.) Each team will pitch their hack to the judges, explaining its purpose, usability, and creativity.",
    "round_title_2": "VisionCraft",
    "round_desc_2": "Teams will build upon the hack they created in Round 1, making it more advanced, practical, or innovative. Using industry-standard design tools (AutoCad, Solidworks, Creo, or any other software you prefer), teams will design a 3D model of their refined concept. Teams will showcase their model to the judges, explaining the evolution of their idea, its purpose, and its impact.",
    "eventId": "EVNT23",
    "contact_name_1": "Harshita V",
    "roll_1": "22E123",
    "contact_mobile_1": 8825866273,
    "contact_name_2": "Ramakrishnan V",
    "roll_2": "22P621",
    "contact_mobile_2": 9344680090,
    "hall": "G 401, G 501, G 601 or any other hall in G block",
    "teamSize": "1-4",
    "date": "15",
    "timing": "9.30 AM -12.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQv8QBXFnhnDFWLbtQ9taJU8pHJJnQee0U1wg&s"
  },
  {
    "eventName": "TRY AND TRIUMPH",
    "category": "Science",
    "one_line_desc": "Reflux fast to conquer",
    "description": "Join us in experiencing the mystery unravel during the battle of wits where timely guess and prompt action will help your team ascend higher and higher to conquer the battlefield! The puzzle might seem ordinary and simple for a battle but only the quick-witted can work through it. Get up with your team. Let's wait and watch for who the survivor are.",
    "round_title_1": "The Da Vinci decode",
    "round_desc_1": "Each team will have a 10-minute window to showcase their puzzle-solving skills in this dynamic escape game. Teams will receive a set of clues corresponding to a specific number of locked locks. The challenge lies in using these provided clues to successfully unlock the designated locks within the given time frame. Teams must rely on their collective wit and problem-solving abilities to decipher the hints and conquer the locks presented to them. Only those teams that effectively crack the codes and unlock the required number of locks will advance to the next round of this engaging and competitive event. It's a race against the clock and a test of strategic thinking - are you up for the challenge?",
    "round_title_2": "Trivia Titans",
    "round_desc_2": "Prepare for an epic battle to build an empire in this day-long strategic conquest! The teams that have successfully advanced from the first round are now embarking on a quest to capture the realm. At the outset, each team will be entrusted with a small province, serving as their initial foothold.\n\nTo expand their dominion, teams must undertake assigned tasks that involve conquering the other provinces. The battleground is set, and challenges will arise between competing teams, determining the fate of the lands. The victor of each challenge claims the territory of the defeated, progressively advancing towards the expansion of the empire.\n\nThe dynamic interplay of challenges and tasks will persist until a single team emerges victorious by conquering the maximum they can. It's a test of strategy, teamwork, and resilience as teams strive to outsmart their adversaries and claim supremacy over the realm. Are you ready for the ultimate conquest?\n\nNO OF TASKS: 10-15",
    "eventId": "EVNT24",
    "contact_name_1": "VANI K",
    "roll_1": "22B256",
    "contact_mobile_1": 9791677188,
    "contact_name_2": "AKSHITAA S S",
    "roll_2": "22B203",
    "contact_mobile_2": 9944833805,
    "hall": "J411,J413,J414,J415",
    "eventRules": "Round 1 RULES:\n->The teams are expected to maintain decorum.\n\nThe teams are expected to play fair and not use unnecessary means.\n\nROUND 2 RULES:\n->Each team will be given a set a province to conquer.\n\nTo conquer a province a team will have to play a game and win.\n\nThe team with maximum province will be declared as the winner.\n\nThe teams are expected to maintain decorum.\n\nThe teams are expected to play fair and not use unnecessary means.",
    "teamSize": "3-4",
    "date": "15",
    "timing": "9.30 AM -4.30 PM",
    "closed": false,
    "image": "https://pbs.twimg.com/media/BswUG4aIgAE8821.jpg"
  },
  {
    "eventName": "CIVIL SHOWDOWN",
    "category": "Quiz",
    "one_line_desc": "The Civil Showdown: A thrilling multi-round event to challenge and showcase civil engineering knowledge, skills, and creativity",
    "description": "The CIVIL SHOWDOWN, The event will feature a series of challenging rounds designed to test participants' knowledge, skills, and creativity in the field of civil engineering. With three exhilarating rounds – Hint and Hunt, Quiz and Build, and Towering Triumphs – the event will provide a platform for participants to showcase their expertise and passion for civil engineering.",
    "round_title_1": "Quiz and Build",
    "round_desc_1": "In this round, teams will face a combination of quiz questions designed to test their theoretical knowledge of civil engineering principles. Participants will demonstrate their ability to apply theoretical concepts in practical scenarios, emphasizing both knowledge and practical skills crucial in the field.",
    "round_title_2": "Hint and Hunt",
    "round_desc_2": "This round will challenge teams to navigate through a series of clues and challenges related to civil engineering materials and equipment. Participants will showcase their knowledge of these materials and equipment, making it an exciting and educational start to the competition.",
    "round_title_3": "Towering Triumphs",
    "round_desc_3": "The final round, Towering Triumphs, will put teams' creativity and engineering prowess to the test as they are tasked with designing and constructing a tower using newspapers. This round will showcase participants' innovation, teamwork, and ability to think critically under pressure, culminating in impressive structures that reflect their engineering acumen.",
    "eventId": "EVNT25",
    "contact_name_1": "Vinoth Kumar S",
    "roll_1": "22c129",
    "contact_mobile_1": 8072899952,
    "contact_name_2": "Salman A",
    "roll_2": "23c402",
    "contact_mobile_2": 9092605000,
    "hall": "J314 & J315",
    "eventRules": "Round 1 RULES:\n->Each team will consist of 2 to 3 members. In this round, 30 multiple-choice questions (MCQs) will be asked, and a time limit of 10 minutes will be given to each team. Teams scoring more than 10 marks will qualify for the next round.\n\nRound 2 RULES:\n->Team members will be asked to sit opposite each other. A construction material's name will be assigned to each person, and that person will have to communicate the name to the opposite person without directly using the word. The opposite person will then have to guess the name of the material.A total of 30 material name, for  each correct answer, an ice stick will be provided to the team. All the teams will advance to the next round. In the next round, the teams will use the ice sticks they have collected to build a tower.\n\nRound 3 RULES:\n->Each team will be provided with 5 full newspapers and asked to construct a tower. The tower must consist only of the newspapers and the ice sticks earned by each team in the previous round. A total of 45 minutes will be given to each team for construction. The final evaluation will be based on the height, strength, and visual appearance of the tower.",
    "teamSize": "2-3",
    "date": "14",
    "timing": "1.30 PM - 4.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSwBX-k5B4Xg8HxozF0i718T5gWOxN4KHI1nQ&s"
  },
  {
    "eventName": "Civilphilia",
    "category": "Core Engineering",
    "one_line_desc": "\"Design,develope dominate\"",
    "description": "The Civil Engineering Challenge is a comprehensive three-round competition designed to test the knowledge, skills, and creativity of civil engineering students and professionals. This event aims to provide a platform for participants to showcase their expertise, learn from their peers, and demonstrate their problem-solving skills.",
    "round_title_1": "Civil Insight",
    "round_desc_1": "Civil Insight is the first round of the competition, designed to assess participants' knowledge of civil engineering basics. This round will be conducted online via QR code.",
    "round_title_2": "Material mastery",
    "round_desc_2": "Material Mastery (Visual Identification and Question-Answer Session)\r\nMaterial Mastery is the second round of the competition, designed to test participants' knowledge of civil construction materials.",
    "round_title_3": "Design Dynamics",
    "round_desc_3": "Design Dynamics is the final round of the competition, designed to test participants' skills in designing and drafting civil engineering projects using AutoCAD software.",
    "eventId": "EVNT26",
    "contact_name_1": "Aadhithya A P",
    "roll_1": "22c101",
    "contact_mobile_1": 9442471929,
    "contact_name_2": "Rahul G V",
    "roll_2": "22c119",
    "contact_mobile_2": 9344813153,
    "hall": "Civil department UG computer lab and K206 Seminar hall",
    "eventRules": "Round 1 RULES:\n->10 minutes\r\nFormat:Online quiz via QR code\r\nQuestions:10 multiple-choice questions on civil engineering basics, including topics such as structural analysis, materials science, and construction management\r\nScoring: Correct answers and time taken to complete the quiz will be considered for scoring\r\nSelection:The top 10 teams with the highest scores and fastest completion times will advance to the next round.\n\nRound 2 RULES:\n->20 minutes\r\nFormat: Visual identification and question-answer session\r\nMaterials:10 civil construction materials will be displayed visually, and participants will be required to choose one material and answer 10 questions related to it\r\nScoring: Correct answers and material chosen will be considered for scoring\r\nSelection:The top 5 teams with the highest scores will advance to the final round.\n\nRound 3 RULES:\n->1 hour  Format: AutoCAD design challenge\r\nTask: Participants will receive an FSI value and plot area, and will be required to design a layout using AutoCAD software.",
    "teamSize": "2-3",
    "date": "15",
    "timing": "9.30 AM - 12.30 PM",
    "closed": false,
    "image": "https://m.media-amazon.com/images/I/71B3ZWZERpL._AC_UF1000,1000_QL80_.jpg"
  },
  {
    "eventName": "Circuityzer",
    "category": "Science",
    "one_line_desc": "Decode, Design, Deliver!",
    "description": "Welcome to Circuityzer, an exciting event focused on electrical and electronic circuits. This technical event is designed to help you improve your skills and challenge yourself in real-world circuit problems. Whether you are new to engineering or love working with circuits, this event will test your ability to troubleshoot, design, and model circuits.",
    "round_title_1": "Circuit Detective",
    "round_desc_1": "In this round, you will practice your troubleshooting skills. You will be given circuits with faults, and your task is to find and fix the issues. Prove your ability to think critically and solve problems.",
    "round_title_2": "The Architect's Blueprint",
    "round_desc_2": "This round will have you take real-world objects and turn them into electrical circuits. You will calculate outputs using circuit parameters and connect theory with practice.",
    "round_title_3": "The Designer’s Forge",
    "round_desc_3": "Show off your creativity by designing a circuit that fits specific requirements. Use simulation software to check your design and demonstrate your problem-solving skills.",
    "eventId": "EVNT27",
    "contact_name_1": "Guru Ragavendhran A S",
    "roll_1": "22U214",
    "contact_mobile_1": 9944857396,
    "contact_name_2": "Sruthi V",
    "roll_2": "22U247",
    "contact_mobile_2": 9384198014,
    "hall": "G-502, G-503",
    "eventRules": "ROUND 1 RULES:\n->1.Participants are not allowed to use mobile phones or AI-based websites for computing solutions.\n\nROUND 2:\n->1.Participants are not allowed to use mobile phones or AI-based websites for computing solutions.\n2.Each team will have a fixed time limit to model circuits based on real-world objects.\n\nRound 3 RULES:\n->1.Each team will have a fixed time limit to design a circuit that meets specific requirements.\n2.Participants must use a convenient simulation software to test and validate their designs.\n3.Participants are not allowed to use mobile phones, AI-based websites or any reference materials for computing solutions.",
    "teamSize": "2-4",
    "date": "15",
    "timing": "9.30 AM  - 12.30 PM",
    "closed": false,
    "image": "https://images.twinkl.co.uk/tw1n/image/private/t_630/u/ux/screenshot-2021-03-16-at-15.15.55_ver_1.png"
  },
  {
    "eventName": "TechTrails",
    "category": "Coding",
    "one_line_desc": "Unravel Mysteries, Decode Clues, and Conquer the Challenge!",
    "description": "An exhilarating multi-round event designed for problem solvers and puzzle enthusiasts! Get ready to test your skills in a series of engaging and thought-provoking rounds that will push your logic, creativity, and coding abilities to the limit. Each solution from the previous round serves as the key to unlock the next!",
    "round_title_1": "Sherlock's Challenge: Unravel the Criminal Mystery",
    "round_desc_1": "Dive into a thrilling CRIME SCENE INVESTIGATION! Solve the mystery by piecing together clues from the crime scene to decode a hidden message. Uncover the CLUE or ANSWER that will unlock your path to the next round. Put on your detective hat and prepare for an exciting challenge!",
    "round_title_2": "Code Rescuer",
    "round_desc_2": "Step into the shoes of a programmer in distress! In Code Rescuer, you'll tackle a broken program that needs your keen eye and problem-solving skills. Debug the code and restore its functionality to advance to the next thrilling stage.",
    "round_title_3": "Logic Labyrinth",
    "round_desc_3": "Here, you will encounter brain-teasing puzzles that will challenge your reasoning abilities. Each puzzle will test your deductive skills and analytical thinking. Use your wit to solve these conundrums and unlock the door to your next adventure. Can you navigate the twists and turns of logic?.\n",
    "round_title_4": "Code Sprint",
    "round_desc_4": "Get your coding skills ready for a challenge in **Code Sprint**! This round presents a coding task that you must complete within a fixed time limit. Showcase your programming prowess and race against the clock to secure your spot in the final round. Are you fast enough?",
    "eventId": "EVNT28",
    "contact_name_1": "Athmikha C D S",
    "roll_1": "21PW04",
    "contact_mobile_1": 7604903279,
    "contact_name_2": "S Swarneshwar",
    "roll_2": "21PW25",
    "contact_mobile_2": 8610042672,
    "hall": "CC LAB",
    "eventRules": "Round 1 RULES:\n->The solution of Round 1 unlocks the key to Round 2.\n\nRound 2 RULES:\n->The solution of Round 2 unlocks the key to Round 3.\n\nRound 1 and Round 2 together must be completed within the stipulated time; however, the time for individual rounds may be flexible within this total duration.\n\nRound 3 RULES:\n->The solution of Round 3 unlocks the key to Round 4.\n\nRound 4 RULES:\n->Round 3 and Round 4 together must be completed within the stipulated time; however, the time for individual rounds may be flexible within this total duration.\n",
    "teamSize": "1-2",
    "date": "14",
    "timing": "9.30 AM  - 12.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRmqrvxOLVLqJXtzdZK5eXsOzetQNdW4v7ExA&s"
  },
  {
    "eventName": "WhizZone",
    "category": "Science",
    "one_line_desc": "Explore the Unknown, Redefine the Known!",
    "description": "Calling all creative minds to challenge themselves and others through a series of engaging rounds! Teams will explore diverse questions, creative illustrations, and hands-on challenges that blend fun with learning.",
    "round_title_1": "CodeTrix",
    "round_desc_1": "Teams will engage in a series of diverse questions including references to science in popular culture, intriguing scenarios, and clever memes. The teams will decode clues and solve puzzles to unlock the next stage of the competition.",
    "round_title_2": "Transformize",
    "round_desc_2": "This round is where creativity and teamwork take center stage. Teams will illustrate a unique phenomenon on a blank sheet of paper. With a timer set, the teams will have just a few minutes to convey the given concept visually. As the drawings are passed around, every other team will guess what is depicted.",
    "round_title_3": "Tensify",
    "round_desc_3": "Every team will tackle simple everyday challenges (like balancing challenges, mini catapult building) while explaining the underlying concepts behind their solutions with their critical thinking skills.",
    "eventId": "EVNT29",
    "contact_name_1": "Pavithra S",
    "roll_1": "22L250",
    "contact_mobile_1": 8248411707,
    "contact_name_2": "Shakthi Lakshmi S",
    "roll_2": "22L263",
    "contact_mobile_2": 8248693937,
    "hall": "G401, G402",
    "eventRules": "ROUND 1 RULES:\n->1. Each team has to solve 20 questions.\n2. Usage of mobile is prohibited.\n\nRound 2 RULES:\n->1. Time limit is set for both drawing and guessing the concept accordingly.\n2. The teams may not write anything regarding the concept; only illustrations are allowed.\n3. Since the number of times a team's drawing is correctly guessed contributes to bonus points, teams should ensure their drawings are clear.\n\nRound 3 RULES:\n->1. Teams will have to complete challenges in the given order.\n2. The teams can complete as many challenges as they can.\n3. Overall timing and creativity will be the criteria for winning.",
    "teamSize": "2",
    "date": "15",
    "timing": "9.30 AM - 12.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTLfEpBfafmb1nrSSD3s4tlBQZXvpUoksGLWg&s"
  },
  {
    "eventName": "TechWhiz",
    "category": "Core Engineering",
    "one_line_desc": "Innovate, Ideate, Integrate",
    "description": "A thrilling Hackathon event where innovation meets collaboration! Tackle real-world challenges in coding, design, tech and Collaborate in teams to create impactful solutions using cutting-edge tools and technologies.",
    "round_title_1": "Virtuoz",
    "round_desc_1": "In Round One, participants will be required to choose from a list of predefined domains. These domains will encompass various areas such as software development, hardware innovation or other technology-related fields. After selecting a domain, participants are encouraged to identify and propose their own unique problem statements within that domain. Once participants have identified their problem statement, they must develop a clear and innovative solution. They will be asked to prepare a presentation to effectively communicate their proposed solution. \r\n\r\nDomains: \r\n1.Artificial intelligence and machine learning \r\n2.Embedded systems \r\n3.Electronics for renewable energy \r\n4.Smart cities\r\n5.Biomedical technology\r\n6.IoT and automation\r\n7.Quantum computing and electronics\r\n\r\nPoints to be noted during presentation: \r\n1. Problem Statement: A clear and concise definition of the problem they intend to solve, emphasizing the relevance and impact of the issue. \r\n2. Proposed Solution: A description of the proposed solution, including the technologies or methodologies that will be used. \r\n3. Feasibility: A discussion of how practical and achievable the solution is within the given time frame and resources. \r\n4. Innovation: An explanation of how their approach is unique, creative, or offers a significant improvement over existing solutions. \r\n5. Impact: A vision of how the solution can benefit the target audience or community.",
    "round_title_2": "Hacktivate",
    "round_desc_2": "Round 2 is to assess the practical implementation of the ideas proposed in Round 1. Participants are required to bring their working prototypes to demonstrate the viability and effectiveness of their solutions. \r\nProcess: \r\n1. Prototype Submission: Participants must develop and bring a functional prototype based on their Round 1 proposal. \r\n2. Prototype Presentation: Teams present their prototype, explaining the design, development process, and how the solution addresses the problem. \r\n3. Evaluation Criteria: \r\n   Innovation: Originality and creativity of the solution. \r\n   Technical Complexity: The technical depth and tools used. \r\n   Practical Application: Feasibility and effectiveness of the prototype in \r\n   solving the problem. \r\n   Usability: User-friendliness and ease of use.",
    "eventId": "EVNT30",
    "contact_name_1": "Nivita S S",
    "roll_1": "22E140",
    "contact_mobile_1": 9345556315,
    "contact_name_2": "Gobihashree S",
    "roll_2": "22L113",
    "contact_mobile_2": 8778541019,
    "hall": "G406,G407",
    "eventRules": "ROUND 1 RULES:\n->1.Participants can form teams of 2-4 members. No individual participation is allowed. \r\n2.Participants must select one of the given domains and propose a unique problem statement or solution within that domain. \r\n3.All submissions must be the original work of the participants. Plagiarism or use of pre-existing solutions is prohibited.\r\n4.All teams must send their PPT, a day before the event (through WhatsApp or mail which will be informed later) \r\n5.Duration given for each team to present is within 10-15 minutes.\r\n6.There is no limit for number of slides, but strictly adhere to time limit.\n\nRound 2 RULES:\n->1. Round 2 selected teams must display and present their models.\r\n2. Time limit for each team is within 15 minutes.\r\n3. Participants must bring their laptops, if necessary.",
    "teamSize": "2-4",
    "date": "15",
    "timing": "9.30 AM - 4.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQCkRTGXgUGiBdiAv-HRH3uVWK0ZjP0nY51dw&s"
  },
  {
    "eventName": "Mindventure",
    "category": "Quiz",
    "one_line_desc": "Solve the mystery,catch the victory",
    "description": "\"A Thrilling Quest for the Sharpest Minds\"\nDive into a two-round adventure where strategy, speed, and teamwork are key. Start by connecting the dots in a quiz challenge, uncovering the hidden link among your answers. Advance to the final round to chase QR codes, solve puzzles, and race against time. Will your team emerge victorious?",
    "round_title_1": "Connect the dots",
    "round_desc_1": "Round 1: Connect the Dots\nIn the first round, a quiz will be projected on a screen for all participants to view. Teams will answer the questions using their mobile phones by selecting the correct options. After completing all the questions, they will need to figure out a common connection between their answers. Teams that find the connection within the given time will advance to the final round.\n",
    "round_title_2": "The QR chase",
    "round_desc_2": "Round 2: The QR Chase\nIn the final round, the room will have QR codes pasted in various locations. Teams will scan these QR codes, solve the questions displayed on their phones, and proceed through the challenges. The team that completes all the QR questions first will be declared the winner.\n",
    "eventId": "EVNT31",
    "contact_name_1": "Mohana priya V M",
    "roll_1": "22d230",
    "contact_mobile_1": 6382353714,
    "contact_name_2": "Hanishka K R",
    "roll_2": "22d217",
    "contact_mobile_2": 7904257282,
    "hall": "J415",
    "eventRules": "RULES:\n->Teams should have 2 participants \nParticipants should strictly adhere to the time limits \nSwitching of tabs should be avoided.",
    "teamSize": "2",
    "date": "16",
    "timing": "9.30 AM - 12.30 PM",
    "closed": false,
    "image": "https://pbs.twimg.com/profile_images/1032666235534630912/T0bk_yVW_400x400.jpg"
  },
  {
    "eventName": "Auto Arena",
    "category": "Bot",
    "one_line_desc": "Bridgecraft Showdown !!",
    "description": "Phase 1: Bolt & Nut Match Challenge\r\nParticipants match various bolts to their exact nuts, focusing on threading systems, precision, and speed. Faster completion earns higher points.\r\n\r\nPhase 2: Ice Stick Bridge Challenge\r\nTeams build a bridge using ice sticks and glue, earning extra materials by answering technical quiz questions. Winners of Phase 1 gain additional resources. Bridges are tested for maximum load-bearing capacity to determine the winner.\r\n\r\nRound 2: Bridge the Gap – ANSYS Unleashed!\r\nA hands-on session where participants analyze a pre-designed bridge/chassis model using ANSYS software. Focus areas include load behavior, material stress analysis, optimization, and safety margin evaluation under different conditions.",
    "round_title_1": "Load & Break",
    "round_desc_1": "Phase 1 :\r\nThe Bolt & Nut Match Challenge is a hands-on, skill-based competition where participants are tasked with matching different types of bolts to their exact corresponding nuts. The event will feature a wide variety of bolts in terms of sizes, threading, and metrics. The goal is to demonstrate knowledge of threading systems, precision, and mechanical understanding as competitors work under time pressure to successfully match each bolt to its perfect nut. Also the team that completing faster will get most points.\r\n\r\nPhase 2 :\r\n          In the Ice Stick Bridge Challenge, teams will compete to build the strongest bridge using only ice sticks and glue. Each team is given a limited number of materials, but they can earn extra ice sticks and glue by answering technical questions correctly in a quiz. The team that wins Phase 1(Bolt & Nut Match Challenge), will gain an advantage by receiving additional materials for bridge construction. Once the bridges are completed, they will be tested by bearing weight, and the bridge that supports the highest load without collapsing will be crowned the winner.",
    "round_title_2": "\"Bridge the Gap: ANSYS Unleashed!\"",
    "round_desc_2": "Round 2 (\"Bridge the Gap: ANSYS Unleashed!\"): \r\n\r\nThis event will provide an in-depth exploration of the analysis of a pre-structured bridge/chasis model using ANSYS software. The session is designed for structural analysts, students, and industry professionals interested in learning about the applications of ANSYS in structural analysis and optimization of bridge/chasis designs.                    \r\nDuring this session, participants will gain hands-on experience in simulating and analyzing the structural behavior of a pre-designed bridge/chasis model. The focus will be on assessing the bridge/chasis's performance under various loading conditions, including traffic, load transfer, and material stresses. Participants will also explore techniques for improving the design through optimization and evaluating the safety margins of the structure.",
    "eventId": "EVNT32",
    "contact_name_1": "M Saravanan",
    "roll_1": "22A241",
    "contact_mobile_1": 8072009797,
    "contact_name_2": "Haritha Lakshmi M R",
    "roll_2": "22A218",
    "contact_mobile_2": 6369992539,
    "hall": "K 401,402 , PACE Lab",
    "eventRules": "Round 1 RULES:\n->1. Materials Provided\r\nEach team will receive:\r\nIce Cream Sticks: Quantity limited (e.g., 50 sticks, specify in advance).\r\nTandoori Sticks: Quantity limited (e.g., 10 sticks, specify in advance).\r\nGlue: 1 bottle (fixed quantity, no additional glue will be provided).\r\n\r\n2. Team Composition\r\nEach team can have 2-4 members.\r\nNo inter-team sharing of materials or tools is allowed.\r\n\r\n3. Time Limit\r\nTeams will be given 1.5 hrs to complete their bridge.\r\nTime extensions will not be granted under any circumstances.\r\n\r\n4. Design Constraints\r\nThe bridge must have:\r\nA minimum span between the supports will be revealed during the time of the event.\r\nA total height not exceeding 30 cm (from the base).\r\nA square-shaped foundation at both support ends, with sides measuring at least 10 cm x 10 cm.\r\nThe bridge must be a freestanding structure and cannot be fixed to the ground or the supports.\r\n\r\n5. Glue Usage\r\nOnly the provided glue may be used for construction.\r\nExcessive glue spills or coating the entire structure with glue is prohibited.\r\nTeams must manage their glue usage; running out of glue is the team’s responsibility.\r\n6. Testing\r\nEach bridge will be tested for strength by placing incremental weights at its center.\r\nThe weights will increase until the bridge fails or meets the predefined maximum load capacity.\r\nA weight plate or container will be placed at the center, and weights will be added gradually.\r\n\r\n7. Judging Criteria\r\nLoad Capacity: The maximum weight the bridge can withstand without failing.\r\nDesign and Aesthetics: The visual appeal and structural ingenuity of the bridge.\r\nMaterial Efficiency: Effective usage of the provided materials (less wastage scores higher).\r\nAdherence to Rules: Teams violating design constraints or using additional materials will be disqualified.\r\n8. Prohibited Actions\r\nTeams cannot use any materials other than those provided.\r\nTampering with or altering the provided materials (e.g., melting, burning) is strictly forbidden.\r\n9. Disqualification\r\nAny team found sharing materials, violating the rules, or indulging in unethical behavior will be disqualified immediately.\r\n\r\n10. Safety Measures\r\nParticipants must handle glue and sharp sticks carefully to avoid injuries.\r\nIn case of emergencies, inform the event coordinators immediately.\r\n\r\nNote\r\nThe decision of the judges will be final and binding.\r\nTeams are encouraged to test and brainstorm designs before the event for optimal results.\n\nRound 2 RULES:\n->Using ANSYS software , participant have to use",
    "teamSize": "2-4",
    "date": "14",
    "timing": "1.30 PM - 4.30 PM",
    "closed": false,
    "image": "https://yt3.googleusercontent.com/ytc/AIdro_mbSLO_88m7aZddT3jRhYXuqnATznnqbaZey3-VplsvUg=s900-c-k-c0x00ffffff-no-rj"
  },
  {
    "eventName": "Astral Arena",
    "category": "Science",
    "one_line_desc": "Unleash creativity and curiosity to conquer the challenges and claim victory!",
    "description": "A fictional host asks \"Why?\" questions from topics like space, math, and physics.\nEach team answers, and points are awarded for clarity, creativity, and accuracy.\nThe team with the highest cumulative points across this round is declared the winner.",
    "round_title_1": "Picture Perception",
    "round_desc_1": "Teams analyze and interpret a given picture within a time limit.\nJudged on creativity, relevance, clarity, and teamwork.\nTop-scoring teams advance to the next round.",
    "round_title_2": "Group Discussion (GD)",
    "round_desc_2": "Teams participate in a discussion on a given topic.\nEvaluated on communication, content, teamwork, and leadership.\nTeams with the lowest scores are eliminated.",
    "round_title_3": "\"Why?\" Challenge",
    "round_desc_3": "A fictional host asks \"Why?\" questions from topics like space, math, and physics.\nEach team answers, and points are awarded for clarity, creativity, and accuracy.\nThe team with the highest cumulative points across this round is declared the winner.",
    "eventId": "EVNT81",
    "contact_name_1": "Janarthanan T",
    "roll_1": "22M227",
    "contact_mobile_1": 9025986325,
    "contact_name_2": "Avinash S",
    "roll_2": "22M211",
    "contact_mobile_2": 8637486324,
    "hall": "Drawing hall",
    "eventRules": "Round 1 RULES:\n->Teams are shown pictures and must write their analysis or interpretation on paper.  \n- Judged on creativity, relevance, and clarity of thought.  \n- *No eliminations* in this round. Scores are carried forward to the next round.\n\nRound 2 RULES:\n->Conducted in three phases, with one representative from each team participating in each phase.  \n- Before the discussion, teams get *5 minutes* to brainstorm and share ideas with their representative.  \n- Representatives discuss the topic while judges evaluate communication, content quality, and teamwork.  \n- Teams with the lowest cumulative scores are eliminated.\n\nRound 3 RULES:\n->A fictional host asks \"Why?\" questions on space, math, and physics, triggered by a bulb lighting up.  \n- Teams answer quickly, earning points for clarity, creativity, and accuracy.  \n- The team with the highest total points is declared the winner.",
    "teamSize": "2-4",
    "date": "15",
    "timing": "9.30 AM -4.30 PM",
    "closed": false,
    "image": "https://i.ytimg.com/vi/S8xEo2lO3p0/maxresdefault.jpg"
  },
  {
    "eventName": "ROBO RALLY",
    "category": "Bot",
    "one_line_desc": "The Ultimate Clash of Robots",
    "description": "The Robo Rally dazzled spectators with cutting-edge robotics as teams from around the state will showcase their autonomous creations in a thrilling race of speed and precision. This high-tech competition pushed the boundaries of artificial intelligence, engineering, and innovation, defining the future of robotics in a dynamic and electrifying spectacle.\nABOUT THE ARENA :\n1)\tThe Arena will consists of a starting point, ending point and two checkpoints on its path.\n2)\tThe obstacles such as ropes, tyres muds etc will be placed on its path.\n3)\tIn case of robot moving out of the track or clashing an obstacle, it has to re-start from the nearest checkpoint.\n4)\tThe first 3 robots completing race will be adjudged as the winner of the respective rounds.\n5)\tThe Arena for the “Heats” will be revealed 1 hour before the round starts and the Arena for the “Final” will be revealed immediately after the first round.\n \nABOUT THE ROBOT :\nBot dimensions : 30x30x30 cm. Bot weight : less than 10 kg.\n1.\tThe robots in the contest must be built by the team members.\n2.\tIf the bot is wired control, the cable length is unlimited. However, be careful not to wind the cable on the facilities and game objects in the field.\n3.\tThe bots are designed in such a way that; it shouldn’t cause any damage to the game field.\n4.\tThe pneumatic system should not be provided. If the team required compressed air, they could be taken up by their own.\n5.\tAir pressure must not exceed 5 bar.\n6.\tAny power source deemed dangerous may be banned from use.\n7.\tBots are inspected before the event starts and checked for the event’s requirements.\n8.\tThe required components are brought on their own, it won’t be provided from the organizer’s side\n",
    "round_title_1": "Heats",
    "round_desc_1": "The race will be conducted on the given arena with obstacles on its path. The first 3 bots which completes the circuit without clashing the obstacles will advance to the finals.",
    "round_title_2": "Finals",
    "round_desc_2": "The race will be conducted on the given circuit with tougher obstacles on its path.The first 3 bots which completes the circuit without clashing the obstacles will be adjudged as winners\n\n",
    "eventId": "EVNT82",
    "contact_name_1": "BALAJI C",
    "roll_1": "22P204",
    "contact_mobile_1": 8828892817,
    "contact_name_2": "DIYA VISHALI R S",
    "roll_2": "22P208",
    "contact_mobile_2": 7604855026,
    "hall": "G301,G302",
    "eventRules": "Round 1 RULES:\n->•\t1) The Arena will consists of a starting point , ending point and two checkpoints on its path.\n\n•\t2) The obstacles such as ropes , tyres muds etc will be placed on its path.\n\n•\t3) In case of robot moving out of the track or clashing an obstacle , it has to re-start from the nearest checkpoint.\n\n•\t4) The first 3 robots completing race will be adjudged as the winner of the respective rounds.\n\n•\t5) The Arena for the “ Heats” will be revealed 1 hour before the round starts and the Arena for the “ Final ” will be revealed immediately after the first round.\n\nRound 2 RULES:\n->•\t1) The Arena will consists of a starting point , ending point and two checkpoints on its path.\n\n•\t2) The obstacles such as ropes , tyres muds etc will be placed on its path.\n\n•\t3) In case of robot moving out of the track or clashing an obstacle , it has to re-start from the nearest checkpoint.\n",
    "teamSize": "2-4",
    "date": "15",
    "timing": "9.30 AM  - 4.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNy-i2zp0pG-SzXdwIuV-FbmwPAMgXsZaC3Q&s"
  },
  {
    "eventName": "Fashion Faceoff: The Ultimate Fashion Quiz",
    "category": "Fashion and Textile",
    "one_line_desc": "Decode trends, win the crown!",
    "description": "Fashion Faceoff is a dynamic quiz event designed to challenge your knowledge of the ever-evolving world of fashion. Across three thrilling rounds, participants will decode trends, identify iconic brands, and tackle a final quiz to prove their knowledge.",
    "round_title_1": "Trend or Trash",
    "round_desc_1": "A visual quiz where participants identify whether a fashion item or the product is a trending or not. Participants will analyze images of clothing, accessories, and trends and mark them as \"Trend\" or \"Trash.\"",
    "round_title_2": "Brand Battle",
    "round_desc_2": "Test your knowledge of fashion brands through visual clues! The goal is to correctly identify brands from visual cues, including brand's logos, product images and slogans.",
    "round_title_3": "Final Fashion Quiz",
    "round_desc_3": "A final rapid-fire quiz that blends all elements of fashion knowledge, from fabrics and designers to upcoming trends.",
    "eventId": "EVNT83",
    "contact_name_1": "Rethiksha K S",
    "roll_1": "22PF26",
    "contact_mobile_1": 7418021340,
    "contact_name_2": "Nithish Kumar R",
    "roll_2": "22IF002",
    "contact_mobile_2": 6369379665,
    "hall": "J Block class or CAD lab (M-block)- projector is mandatory",
    "eventRules": "Round 1 RULES:\n->In the \"Trend or Trash\" event, each team, consisting of 2-4 members, must submit their names and responses on the provided Google Form within the given deadline. \r\nWe will present 15-20 images that teams must classify as either \"Trend\" or \"Trash\" based on current fashion relevance.\r\nTeams will earn 1 point for every correct classification and 0 for incorrect answers. Submissions must be made within the allotted time (e.g., 3 minutes). Only the top-scoring teams will advance to the next round, with ties resolved by a tiebreaker.\n\nRound 2 RULES:\n->Each team must answer within the set time limit. The team with the highest score wins and moves to the next round. All decisions by the organizers and judges are final.\n\nRound 3 RULES:\n->In the rapid-fire round, teams buzz in to answer questions within 10 seconds. The team with the most points at the end wins, and ties are broken with a final question.",
    "teamSize": "2-4",
    "date": "14",
    "timing": "9.30 AM  - 12.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ7f4LSo61Sy1Mc5WNObG5iyWQhn_ZQYcmNPg&s"
  },
  {
    "eventName": "TeeStory: T-Shirt Design Challenge",
    "category": "Fashion and Textile",
    "one_line_desc": "Where Imagination Meets Fashion!",
    "description": "Turn your ideas into wearable art! Design a T-shirt inspired by a story, showcasing your creativity through colors, patterns, and graphics that make your concept come alive.",
    "round_title_1": "Picture Pick",
    "round_desc_1": "Participants will randomly select a chit to determine the theme and pick 4 pictures related to it from a given set. These pictures will form the basis for their design story.",
    "round_title_2": "Story Spin",
    "round_desc_2": "Using the 4 chosen pictures, participants must craft a creative story or concept. This story will act as the inspiration for their T-shirt design.",
    "round_title_3": "Design the Tee",
    "round_desc_3": "Participants will create a T-shirt design inspired by their story, combining creativity and aesthetics to bring their concept to life.",
    "eventId": "EVNT84",
    "contact_name_1": "Subiksa K A",
    "roll_1": "21PF30",
    "contact_mobile_1": 6381787982,
    "contact_name_2": "Aditi T",
    "roll_2": "22IF001",
    "contact_mobile_2": 7708272888,
    "hall": "J Block class or Surface Embellishment lab (M-block)",
    "eventRules": "Round 1 RULES:\n->Each participant picks a chit to determine the theme.\r\nChoose 4 pictures that best fit the theme.\r\nPictures cannot be swapped with others.\n\nRound 2 RULES:\n->Write a short story or description based on the selected pictures.\r\nEnsure the story aligns with the theme and connects all 4 pictures.\r\nSubmission must be within the given time limit (e.g., 20 minutes).\n\nRound 3 RULES:\n->Use the provided materials to sketch or design the T-shirt.\r\nThe design must reflect the story and incorporate elements from the pictures.\r\nDesigns must be submitted within the given time limit (e.g., 45 minutes).\r\nJudging will be based on creativity, relevance to the story, and overall appeal.",
    "teamSize": "1-2",
    "date": "14",
    "timing": "1.30 PM - 4.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ6LwWev4VzipdaBXxencBSnfZ4SAI0QjJq3g&s"
  },
  {
    "eventName": "Solar implant",
    "category": "Core Engineering",
    "one_line_desc": "An innovative approach to optimize home energy costs with simplified, solar-powered tariff calculations.",
    "description": "Solar Implant is a comprehensive event aimed at understanding energy consumption and solar energy solutions. Participants will calculate electrical parameters like current, voltage, power, and energy consumption, along with determining tariffs in Round 1. In Round 2, they will design a solar energy setup by selecting appropriate solar panels and understanding inverter basics. The event combines analytical, technical, and practical knowledge to optimize energy use. It empowers participants with skills to design efficient and sustainable energy systems.",
    "round_title_1": "Electrical Parameter Calculation and Tariff Analysis",
    "round_desc_1": "In this round, participants will be provided with data on circuit configurations, appliance ratings, and a detailed tariff sheet. Using this information, they must calculate essential electrical parameters, including current, voltage, power, and energy consumption. Participants will then analyze the results to determine the total tariff for the circuits based on the provided formulas. This round tests their ability to interpret data, perform precise calculations, and apply theoretical knowledge in practical scenarios. Accuracy and efficiency will be key to advancing to the next round.",
    "round_title_2": "Solar Panel Selection and Inverter Basics",
    "round_desc_2": "In this round, participants will use the energy requirements calculated in Round 1 to select the most suitable solar panels for the given setup. They must consider factors such as panel efficiency, power output, and compatibility with the system. Additionally, participants will apply basic knowledge about inverters to ensure proper integration of the solar panels with the electrical system. This round emphasizes practical decision-making and technical understanding of solar energy solutions. Participants will be evaluated on the feasibility, efficiency, and optimization of their designs.",
    "eventId": "EVNT85",
    "contact_name_1": "Nisha brishilla S",
    "roll_1": "22e628",
    "contact_mobile_1": 9361555686,
    "contact_name_2": "Kaviya P",
    "roll_2": "22e617",
    "contact_mobile_2": 7867925399,
    "hall": "J 307,J308,J309",
    "eventRules": "RULES:\n->Participants should strictly adhere to the time limit. \r\nParticipants are strictly prohibited from using the internet.\r\nParticipants are advised not to indulge in any form of malpractice.",
    "teamSize": "2-3",
    "date": "15",
    "timing": "9.30 AM  - 4.30 PM",
    "closed": false,
    "image": "https://images.crunchbase.com/image/upload/c_pad,h_256,w_256,f_auto,q_auto:eco,dpr_1/hsbysuq9mwk7wemdn6yw"
  },
  {
    "eventName": "CRITICAL THINKER",
    "category": "Core Engineering",
    "one_line_desc": "BRIDGE BULDING",
    "description": "The Bridge Building Competition is a highly engaging and creative event designed to test participants' engineering skills, structural understanding, and teamwork. In this challenge, participants use ice cream sticks (craft sticks), glue, and thread to construct a bridge model that meets specific criteria and is judged based on several performance metrics. This event encourages innovation, problem-solving, and hands-on learning in a competitive and fun environment.",
    "round_title_1": "Technical Quiz",
    "round_desc_1": "Technical Quiz: The initial round featured a quiz on various Technical aspects of mechanical engineering.",
    "round_title_2": "Bridge Building Challenge",
    "round_desc_2": "Bridge Building Challenge: In the second round, selected teams faced the practical challenge of constructing a bridge using ice sticks, thread, and glue.",
    "eventId": "EVNT86",
    "contact_name_1": "KAVIN KUMAR",
    "roll_1": "22M404",
    "contact_mobile_1": 9578680392,
    "contact_name_2": "PERIYASAMY",
    "roll_2": "22M403",
    "contact_mobile_2": 9629846777,
    "hall": "G 401",
    "eventRules": "Round 1 RULES:\n->Based on their scores, teams were shortlisted for the next round.\n\nRound 2 RULES:\n->They were provided with dimension constraints to adhere to during construction. Additionally, teams were required to provide written applications detailing the intended purpose and design considerations of their bridges.Once the construction phase was complete, the bridges underwent inspection. Judging criteria included both functionality and aesthetics. Judges meticulously evaluated each bridge, considering factors such as load-bearing capacity, structural integrity, and visual appeal.",
    "teamSize": "2-4",
    "date": "16",
    "timing": "9.30 AM -12.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ-MV5Yn77huv-iuEkgJWxB5Cw2gTJv85te0A&s"
  },
  {
    "eventName": "Levitas",
    "category": "Core Engineering",
    "one_line_desc": "Engineering the Art of Flight",
    "description": "\"Levitas\" is a 6 hrs technical competition that challenges participants to apply their understanding of aerodynamics and engineering principles to design, test, and optimize paper planes. This event fosters creativity, analytical thinking, and teamwork through three competitive rounds.",
    "round_title_1": "Aerodynamic Design and Engineering Analysis",
    "round_desc_1": "Craft a paper plane focusing on aerodynamic efficiency and engineering \nprinciples. Includes submitting a brief explanation of their design covering aspects like lift, drag, stability and centre of gravity.",
    "round_title_2": "Precision and Control Challenge",
    "round_desc_2": "This round evaluates the precision and control of paper planes by challenging participants to fly through a series of hoops and achieve a controlled landing in a designated zone. The focus is on flight accuracy, path control, and landing finesse.",
    "round_title_3": "Relay Circuit Challenge",
    "round_desc_3": "This round emphasizes teamwork, precision, and timing as teams participate in a relay-style event. Each team member launches their plane in sequence, navigating through checkpoints and hitting designated targets, showcasing collaboration and flight accuracy.",
    "eventId": "EVNT87",
    "contact_name_1": "Deepti V",
    "roll_1": "21M605",
    "contact_mobile_1": 8667332990,
    "contact_name_2": "Pretyush S",
    "roll_2": "22A237",
    "contact_mobile_2": 9025548549,
    "hall": "Basketball Court",
    "eventRules": "Round 1 RULES:\n->Use only the provided materials for construction.\nDesigns must demonstrate aerodynamic stability and durability.\nAll planes must meet the specified size and design considerations.\nTeams must complete their designs within the allotted time.\n\nRound 2 RULES:\n->Participants must aim their planes at circular hoops placed at varying distances.\nPoints are awarded based on the number of hoops successfully cleared.\nIn the landing segment, planes must land inside a designated landing zone.\nAdditional points will be granted for controlled and smooth landings.\nEach participant/team gets a limited number of attempts to complete both tasks.\n\nRound 3 RULES:\n->Teams must launch their planes one after the other in a relay sequence.\nPlanes are required to pass through a series of checkpoints or hit designated targets in the correct order.\nA missed checkpoint requires retries, adding to the overall time.\nEach team member gets only one turn per relay sequence.\nTeams have a limited time to complete the challenge.",
    "teamSize": "3-6",
    "date": "15",
    "timing": "9.30 AM -4.30 PM",
    "closed": false,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTbR7ehhUcmAWzjK2xknRK2CjkQDtQbwG9V_A&s"
  },
  {
    "eventName": "Techvisions",
    "category": "Brainiac",
    "one_line_desc": "Assess the market's technical textiles.",
    "description": "In this event, competitors are required to analyze and evaluate a recently developed technical textile product available in the market. They should explore various aspects related to its production line, GSM, features, specifications, testing, and more. The presentation should follow the format of a paper presentation.",
    "round_title_1": "Technivisions",
    "round_desc_1": "Present your ideas and convince the judges to showcase your talents and show your expertise",
    "eventId": "EVNT0039",
    "contact_name_1": "Thanusri S",
    "roll_1": "21T224",
    "contact_mobile_1": 9566894004,
    "contact_name_2": "DeviSoundharya J",
    "roll_2": "21T102",
    "contact_mobile_2": 8778445761,
    "hall": "H-207",
    "eventRules": "Abstract should not exceed more than 250 words.\n->Presentation should not exceed more than 7-8 minutes.\n->The deadline for submitting an abstract is one week before the competition.\n->Each team consists of a maximum of 2 members.",
    "teamSize": "1-2",
    "date": "24",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Traditional Games Galore",
    "category": "Kriyative",
    "one_line_desc": "Beyond a game, unveiling nostalgia",
    "description": "Traditional Games Galore event promises a dynamic celebration of both intellect and agility, bringing together the best of two worlds.The following event is dedicated to reviving the charm of games that have been cherished across generations. Participants will find themselves transported to a vibrant arena. It seamlessly blends the excitement of a technical quiz with the everlasting thrill of traditional games which will provide diverse experiences and create a memorable journey that resonates with participants from all the years.",
    "round_title_1": "TECHGRID CHALLENGE",
    "round_desc_1": "TechGrid Challenge is an engaging game that blends the strategic gameplay of Dots and Boxes with the intellectual challenge of answering technical questions. Players aim to create boxes on the grid by connecting dots while strategically answering technical questions to gain an edge over their opponents.",
    "round_title_2": " TECH HOP CHALLENGE and PALLANGUZHI CLASH",
    "round_desc_2": "Pallanguzhi Clash is an innovative game merging the intellectual challenge of technical questions with the strategic gameplay of Pallanguzhi, a traditional Indian board game. The game is played on a specially designed board that incorporates the essence of both elements\n\nThe TechHop Challenge is a unique fusion of intellectual prowess and physical agility, combining the structure of a traditional  Hopscotch game with the challenge of answering technical questions. The game is played on a marked-out Hopscotch court, each section representing a different level of difficulty. ",
    "round_title_3": "KOTHAN KALLU",
    "round_desc_3": "“Kothan Kallu” is an inventive game that merges the thrill of answering technical questions with the traditional gameplay of Kothan Kallu, a popular South Asian stone-throwing game. Players aim to score points by correctly answering technical questions and demonstrating accuracy in their stone-throwing skills.",
    "eventId": "EVNT0040",
    "contact_name_1": "Kruthi T P",
    "roll_1": "21P210",
    "contact_mobile_1": 9963427530,
    "contact_name_2": "Mukesh Kumar R",
    "roll_2": "20P617",
    "contact_mobile_2": 9092444505,
    "hall": "G BLOCK (401,402)",
    "eventRules": "Round 1 Rules:\n->A square grid is drawn on the playing surface, creating an array of dots. Each intersection of dots represents a potential connection point.\n->A set of technical question cards are prepared, featuring questions related to technical subjects.\n->Each team is assigned a unique marker or color to connect dots and create boxes on the TechGrid.\n->Two teams take turns in answering a technical question. The difficulty level determines the number of lines (connections) they can make on the TechGrid.\n->After answering the technical question, the player from a team connects two adjacent dots by drawing a line. The objective is to strategically form a square by completing the fourth side.\n->Whenever a team completes a square by connecting the fourth side, they write their first alphabet of their team’s name inside the box and earn a point. The player gets an additional technical question card for each completed box.\n->Special challenges may be introduced, where players can claim a bonus box or hinder opponents by correctly answering advanced technical questions.\n->The Team with the most completed boxes and points at the end of the game, combining strategic dot connections and successful technical challenges, wins the \"TechGrid Challenge.\"\nRound 2 Rules: \nPallanguzhi:\n->Players aim to accumulate points by successfully answering technical questions while strategically managing the seeds in their Pallanguzhi pits. \n->The game consists of two rows of small pits (representing Pallanguzhi pits) and a central area for technical questions. \n->A set of technical question cards is prepared, each card containing a question related to tech related topics.\n->Small game seeds or tokens (sozhi) represent the traditional Pallanguzhi game pieces. \n->Players use these shells to play both Players take turns drawing a technical question card. If the answer is correct, they receive a chance to play the game where the player distributes the collected seeds among their pits following traditional Pallanguzhi rules. \n->Players strategically move seeds between pits to capture their opponent's seeds, incorporating the traditional Pallanguzhi tactics. \n->Players score points based on the number of seeds in their pits, with bonus points awarded for correctly answered technical questions. \n->The player with the highest combined score from strategic Pallanguzhi moves and successful technical challenges wins the round \nTech Hop Challenge:\n->A set of technical questions is prepared, ranging in difficulty.\n->Each player receives a pebble to toss onto the court one by one from square 1 to 8.\n->Teams take turns throwing their tokens onto the Hopscotch court. The number on the square where the token lands corresponds to a technical question.\n->The Team must answer the question correctly to advance to the next level.\n->Players hop through the court following traditional Hopscotch rules. However, their team must recite the correct answer to the technical question associated with the square they land on.\n->Successfully answering the question allows the player to progress to the next level. Failure results in the player facing a penalty, which is going back a square.\n->The first team to successfully navigate the entire Hopscotch court by answering all the technical questions wins the \"TechHop Challenge.\"\nRound 3 Rules:\n->A set of technical question cards is prepared, featuring questions related to tech-related subjects.\n->Players take turns drawing a technical question card. After answering the technical question, players attempt to throw their Stones and catch them.\n->Based on the number of stones they collect and the correct answers they give, players earn points. Players must balance accurate stone-throwing with their technical proficiency to maximize their overall score.\n->Special Challenges may be introduced, where players attempt specific stone-throwing tasks related to technical concepts.\n->The team with the highest combined score from technical questions and accurate catching of the stone throws wins the “Kothan Kallu” Challenge.",
    "teamSize": 2,
    "date": "25",
    "timing": "9.30 AM -12.30 PM"
  },
  {
    "eventName": "Try and triumph",
    "category": "Brainiac",
    "one_line_desc": "Reflex fast to conquer",
    "description": "The faster you act, the more will be your conquer. Join us in experiencing the mystery unravel, during the battle of wits. The puzzles might seem ordinary and simple for a battle but only the quick-witted can work through it. Gear up with your team. Let's wait and celebrate the survivors.",
    "round_title_1": "The Da Vinci decode",
    "round_desc_1": "Each team will have a 10-minute window to showcase their puzzle-solving skills . Teams will receive a set of clues. Using the provided clues teams can successfully unlock the designated locks .Teams must rely on their problem-solving abilities to decipher the hints and conquer the locks presented to them. Only those teams that effectively crack the code will advance to the next round . Are you up for the challenge?",
    "round_title_2": "Trivia Titans",
    "round_desc_2": "Engage in a day-long strategic conquest to build empires. Teams begin with small provinces and expand by completing assigned tasks. Challenges between teams determine the fate of lands, with victors claiming defeated territories. The dynamic play continues until one team conquers the maximum land, testing strategy, teamwork, and resilience in an epic battle.",
    "eventId": "EVNT0041",
    "contact_name_1": "Bavana Yalini L",
    "roll_1": "21B208",
    "contact_mobile_1": 9791833878,
    "contact_name_2": "Shwetha Chandrasekaran ",
    "roll_2": "21B247",
    "contact_mobile_2": 9600366039,
    "hall": "J BLOCK(411,413,414,415)",
    "eventRules": "Round 1 Rules:\n->The teams are expected to maintain decorum.\n->The teams are expected to play fair and not use unnecessary means.\nRound 2 Rules:\n->Each team will be given a set a province to conquer.\n->To conquer a province, a team will have to play a game and win.\n->The team with the maximum province will be declared as the winner.\n->The teams are expected to maintain decorum.\n->The teams are expected to play fair and not use unnecessary means.",
    "teamSize": "3-4",
    "date": "23",
    "timing": "9.30 AM  - 4.30 PM"
  },
  {
    "eventName": "Witty Mindz",
    "category": "Amuse",
    "one_line_desc": "Stratergic exchange yields victory!",
    "description": "Are you a play-based learner? Are you a quick thinker? then this is the right platform to show case your talent. Grab your partner and show off your witty minds.",
    "round_title_1": "VerboVibe",
    "round_desc_1": "Team consisting of 2 members chooses one chit, which contains two alphabets in which each member chooses one alphabet. The total duration is 5 minutes. Every minute, players switch letters within a team and start writing in the switched alphabet. There is no discussion between team members. If both players write the same word, it will be counted as one. The top-scoring teams will be selected for the next round.",
    "round_title_2": "DecodeDrama",
    "round_desc_2": "This round includes both cracking a jumbled word that will be related to computer science and \"charades.\" One team member has to crack the jumbled word, and after cracking it, he/she has to act it out to the other team member. It is similar to \"charades.\" The total duration is 10 minutes.",
    "eventId": "EVNT0042",
    "contact_name_1": "Roshini E",
    "roll_1": "22MX121",
    "contact_mobile_1": 9585657946,
    "contact_name_2": "Subashini R",
    "roll_2": "22MX126",
    "contact_mobile_2": 9942552425,
    "hall": "K BLOCK (505)",
    "eventRules": "Round 1 Rules:\n->Mobile phones are strictly prohibited.\n->No discussion among the teammates.\nRound 2 Rules:\n->No lip synching.",
    "teamSize": 2,
    "date": "23",
    "timing": "9.30 AM -12.30 PM",
    "closed": false
  },
  {
    "eventName": "IT Career Forge",
    "category": "Sponsor",
    "one_line_desc": "Launch Your Dream IT Career with guidance from Vites Technologies, a leading IT Training Institute in Tamil Nadu!!",
    "description": "Launch Your Dream IT Career with guidance from Vites Technologies, a leading IT Training Institute in Tamil Nadu!!",
    "round_title_1": "VerboVibe",
    "round_desc_1": "Team consisting of 2 members chooses one chit, which contains two alphabets in which each member chooses one alphabet. The total duration is 5 minutes. Every minute, players switch letters within a team and start writing in the switched alphabet. There is no discussion between team members. If both players write the same word, it will be counted as one. The top-scoring teams will be selected for the next round.",
    "eventId": "EVNT0043",
    "contact_name_1": "Nakulan",
    "roll_1": "22MX126",
    "contact_mobile_1": 9488964540,
    "hall": "D BLOCK CONFERENCE HALL 1st FLOOR",
    "teamSize": 1,
    "date": "23",
    "timing": "1.30 PM -2.30 PM",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTbR7ehhUcmAWzjK2xknRK2CjkQDtQbwG9V_A&s"
  }
]